artillery_test_results.txt
Artillery test results:

--------------------------------------
Metrics for period to: 11:31:00(+0300) (width: 2.625s)
--------------------------------------

http.codes.200: ................................................................ 44
http.downloaded_bytes: ......................................................... 41784
http.request_rate: ............................................................. 25/sec
http.requests: ................................................................. 44
http.response_time:
  min: ......................................................................... 2
  max: ......................................................................... 72
  mean: ........................................................................ 6.1
  median: ...................................................................... 3
  p95: ......................................................................... 8.9
  p99: ......................................................................... 19.9
http.responses: ................................................................ 44
vusers.completed: .............................................................. 4
vusers.created: ................................................................ 26
vusers.created_by_name.0: ...................................................... 26
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 2049.4
  max: ......................................................................... 2189.3
  mean: ........................................................................ 2113.8
  median: ...................................................................... 2101.1
  p95: ......................................................................... 2143.5
  p99: ......................................................................... 2143.5


--------------------------------------
Metrics for period to: 11:31:10(+0300) (width: 9.997s)
--------------------------------------

http.codes.200: ................................................................ 301
http.downloaded_bytes: ......................................................... 177761
http.request_rate: ............................................................. 30/sec
http.requests: ................................................................. 302
http.response_time:
  min: ......................................................................... 1
  max: ......................................................................... 14
  mean: ........................................................................ 2.6
  median: ...................................................................... 2
  p95: ......................................................................... 4
  p99: ......................................................................... 6
http.responses: ................................................................ 301
vusers.completed: .............................................................. 101
vusers.created: ................................................................ 100
vusers.created_by_name.0: ...................................................... 100
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 2015.3
  max: ......................................................................... 2092.7
  mean: ........................................................................ 2034.6
  median: ...................................................................... 2018.7
  p95: ......................................................................... 2059.5
  p99: ......................................................................... 2101.1


--------------------------------------
Metrics for period to: 11:31:20(+0300) (width: 9.996s)
--------------------------------------

http.codes.200: ................................................................ 300
http.downloaded_bytes: ......................................................... 177900
http.request_rate: ............................................................. 30/sec
http.requests: ................................................................. 300
http.response_time:
  min: ......................................................................... 1
  max: ......................................................................... 28
  mean: ........................................................................ 2.4
  median: ...................................................................... 2
  p95: ......................................................................... 4
  p99: ......................................................................... 10.1
http.responses: ................................................................ 300
vusers.completed: .............................................................. 100
vusers.created: ................................................................ 100
vusers.created_by_name.0: ...................................................... 100
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 2011.6
  max: ......................................................................... 2073.1
  mean: ........................................................................ 2026.7
  median: ...................................................................... 2018.7
  p95: ......................................................................... 2059.5
  p99: ......................................................................... 2059.5


--------------------------------------
Metrics for period to: 11:31:30(+0300) (width: 9.995s)
--------------------------------------

http.codes.200: ................................................................ 300
http.downloaded_bytes: ......................................................... 177900
http.request_rate: ............................................................. 30/sec
http.requests: ................................................................. 299
http.response_time:
  min: ......................................................................... 1
  max: ......................................................................... 12
  mean: ........................................................................ 2.2
  median: ...................................................................... 2
  p95: ......................................................................... 4
  p99: ......................................................................... 7
http.responses: ................................................................ 300
vusers.completed: .............................................................. 100
vusers.created: ................................................................ 100
vusers.created_by_name.0: ...................................................... 100
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 2011
  max: ......................................................................... 2047.6
  mean: ........................................................................ 2024.6
  median: ...................................................................... 2018.7
  p95: ......................................................................... 2059.5
  p99: ......................................................................... 2059.5


--------------------------------------
Metrics for period to: 11:31:40(+0300) (width: 9.999s)
--------------------------------------

http.codes.200: ................................................................ 300
http.downloaded_bytes: ......................................................... 177900
http.request_rate: ............................................................. 30/sec
http.requests: ................................................................. 301
http.response_time:
  min: ......................................................................... 1
  max: ......................................................................... 11
  mean: ........................................................................ 2.2
  median: ...................................................................... 2
  p95: ......................................................................... 4
  p99: ......................................................................... 7
http.responses: ................................................................ 300
vusers.completed: .............................................................. 100
vusers.created: ................................................................ 100
vusers.created_by_name.0: ...................................................... 100
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 2011.5
  max: ......................................................................... 2052
  mean: ........................................................................ 2023.5
  median: ...................................................................... 2018.7
  p95: ......................................................................... 2018.7
  p99: ......................................................................... 2059.5


--------------------------------------
Metrics for period to: 11:31:50(+0300) (width: 9.995s)
--------------------------------------

http.codes.200: ................................................................ 300
http.downloaded_bytes: ......................................................... 177900
http.request_rate: ............................................................. 30/sec
http.requests: ................................................................. 299
http.response_time:
  min: ......................................................................... 1
  max: ......................................................................... 8
  mean: ........................................................................ 1.9
  median: ...................................................................... 2
  p95: ......................................................................... 3
  p99: ......................................................................... 5
http.responses: ................................................................ 300
vusers.completed: .............................................................. 100
vusers.created: ................................................................ 100
vusers.created_by_name.0: ...................................................... 100
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 2010.8
  max: ......................................................................... 2039.7
  mean: ........................................................................ 2019
  median: ...................................................................... 2018.7
  p95: ......................................................................... 2018.7
  p99: ......................................................................... 2059.5


Phase completed: unnamed (index: 0, duration: 60s) 11:31:56(+0300)

--------------------------------------
Metrics for period to: 11:32:00(+0300) (width: 9.291s)
--------------------------------------

http.codes.200: ................................................................ 255
http.downloaded_bytes: ......................................................... 134415
http.request_rate: ............................................................. 30/sec
http.requests: ................................................................. 255
http.response_time:
  min: ......................................................................... 1
  max: ......................................................................... 8
  mean: ........................................................................ 1.9
  median: ...................................................................... 2
  p95: ......................................................................... 3
  p99: ......................................................................... 6
http.responses: ................................................................ 255
vusers.completed: .............................................................. 95
vusers.created: ................................................................ 74
vusers.created_by_name.0: ...................................................... 74
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 2010.2
  max: ......................................................................... 2046.2
  mean: ........................................................................ 2022.8
  median: ...................................................................... 2018.7
  p95: ......................................................................... 2018.7
  p99: ......................................................................... 2059.5


All VUs finished. Total time: 1 minute, 3 seconds

--------------------------------
Summary report @ 11:32:00(+0300)
--------------------------------

http.codes.200: ................................................................ 1800
http.downloaded_bytes: ......................................................... 1065560
http.request_rate: ............................................................. 30/sec
http.requests: ................................................................. 1800
http.response_time:
  min: ......................................................................... 1
  max: ......................................................................... 72
  mean: ........................................................................ 2.3
  median: ...................................................................... 2
  p95: ......................................................................... 4
  p99: ......................................................................... 7.9
http.responses: ................................................................ 1800
vusers.completed: .............................................................. 600
vusers.created: ................................................................ 600
vusers.created_by_name.0: ...................................................... 600
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 2010.2
  max: ......................................................................... 2189.3
  mean: ........................................................................ 2025.8
  median: ...................................................................... 2018.7
  p95: ......................................................................... 2059.5
  p99: ......................................................................... 2101.1
PS C:\Users\Caleb\Desktop\ExBankingGraphQL\ExBankingGraphQL>